src/cfe/ChartsOfCharacteristicTypes/кбп_ПеременныеПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>кбп_ПеременныеПроцессов</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
				<v8:NumberQualifiers>
					<v8:Digits>17</v8:Digits>
					<v8:FractionDigits>5</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВЗадаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cfe/ChartsOfCharacteristicTypes/кбп_ПеременныеПроцессов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.ТипЗначения.Типы().Количество() = 0 Тогда
			Объект.ТипЗначения = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1024));
		КонецЕсли;
	Иначе
		ЗначениеПоУмолчанию = Объект.Ссылка.ЗначениеПоУмолчанию.Получить();
	КонецЕсли;
	Элементы.Схема.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Схема);
	НастроитьЗначениеПоУмолчанию();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Не ЗначениеЗаполнено(ТекущийОбъект.Имя) Тогда
		ТекущийОбъект.Имя = ИмяПоНаименованию(ТекущийОбъект.Наименование);
	КонецЕсли;
	Если Не ЭтоИдентификатор(ТекущийОбъект.Имя) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Имя должно начинаться с буквы и состоять из букв, цифр и «_» (без пробелов).'"), , "Объект.Имя", , Отказ);
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Схема) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Укажите схему процесса.'"), , "Объект.Схема", , Отказ);
		Возврат;
	КонецЕсли;
	Если ИмяЗанято(ТекущийОбъект.Схема, ТекущийОбъект.Имя, ТекущийОбъект.Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'В схеме уже есть переменная с именем «%1».'"), ТекущийОбъект.Имя), , "Объект.Имя", , Отказ);
		Возврат;
	КонецЕсли;
	ТекущийОбъект.ЗначениеПоУмолчанию = Новый ХранилищеЗначения(ТекущийОбъект.ТипЗначения.ПривестиЗначение(ЗначениеПоУмолчанию));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.Имя) Или Объект.Имя = ИмяПоНаименованию(ПрежнееНаименование) Тогда
		Объект.Имя = ИмяПоНаименованию(Объект.Наименование);
	КонецЕсли;
	ПрежнееНаименование = Объект.Наименование;

КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	НастроитьЗначениеПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЗначениеПоУмолчанию()

	Элементы.ЗначениеПоУмолчанию.ОграничениеТипа = Объект.ТипЗначения;
	ЗначениеПоУмолчанию = Объект.ТипЗначения.ПривестиЗначение(ЗначениеПоУмолчанию);
	ПрежнееНаименование = Объект.Наименование;

КонецПроцедуры

// «Сумма согласования» → «СуммаСогласования».
&НаКлиентеНаСервереБезКонтекста
Функция ИмяПоНаименованию(Наименование)

	Допустимые = "abcdefghijklmnopqrstuvwxyzабвгдеёжзийклмнопрстуфхцчшщъыьэюя0123456789_";
	Имя = "";
	СЗаглавной = Истина;
	Для Позиция = 1 По СтрДлина(Наименование) Цикл
		Символ = Сред(Наименование, Позиция, 1);
		Если СтрНайти(Допустимые, НРег(Символ)) = 0 Тогда
			СЗаглавной = Истина;
			Продолжить;
		КонецЕсли;
		Если СЗаглавной Тогда
			Символ = ВРег(Символ);
			СЗаглавной = Ложь;
		КонецЕсли;
		Имя = Имя + Символ;
	КонецЦикла;
	Если ЗначениеЗаполнено(Имя) И СтрНайти("0123456789", Лев(Имя, 1)) > 0 Тогда
		Имя = "_" + Имя;
	КонецЕсли;
	Возврат Лев(Имя, 100);

КонецФункции

&НаСервереБезКонтекста
Функция ЭтоИдентификатор(Имя)

	Если Не ЗначениеЗаполнено(Имя) Тогда
		Возврат Ложь;
	КонецЕсли;
	Попытка
		Проверка = Новый Структура(Имя);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Проверка.Количество() = 1;

КонецФункции

&НаСервереБезКонтекста
Функция ИмяЗанято(Схема, Имя, Ссылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.УстановитьПараметр("Имя", Имя);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Переменные.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.кбп_ПеременныеПроцессов КАК Переменные
	|ГДЕ
	|	Переменные.Схема = &Схема
	|	И Переменные.Имя = &Имя
	|	И Переменные.Ссылка <> &Ссылка
	|	И НЕ Переменные.ПометкаУдаления";
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

#КонецОбласти
